create database pydb;
 use pydb;
CREATE TABLE book (
 id INT NOT NULL AUTO_INCREMENT,
 title VARCHAR(200),
 pub VARCHAR(45),
 pages INT,
 author VARCHAR(100),
 PRIMARY KEY (id)
);

In [14]:
#마리아디비 연결 설정
import pymysql

In [20]:
#select 예제
conn = pymysql.connect(
host='127.0.0.1', 
user='root', 
password='123456',
 db='pydb', 
charset='utf8')
cur = conn.cursor()
cur.execute("SELECT * FROM book")

print("ID    title    writer         ")
print("--------------------------------------------------------")

while (True):
    row = cur.fetchone()
    if row == None:
        break
    data1 = row[0]
    data2 = row[1]
    data3 = row[2]
    
    print("%5s   %15s   %15s \n" % (data1, data2, data3))
    # print(f" ID: {data1}, title: {data2}, writer: {data3}")

conn.close()

ID    title    writer
--------------------------------------------------------
    1             안드로이드                한빛

    2             안드로이드                한빛

    3             안드로이드                한빛

    4         Oracle DB                한빛

    5            Spring                영딘

    6             안드로이드                한빛

    7             안드로이드                한빛

    8         Oracle DB                한빛

    9            Spring                영딘

   10             안드로이드                한빛

   11             안드로이드                한빛

   12         Oracle DB                한빛

   13            Spring                영딘

   14             안드로이드                한빛

   15             안드로이드                한빛

   16         Oracle DB                한빛

   17            Spring                영딘

In [16]:
#insert 예제
def insert_book(data):
    conn=pymysql.connect(host='localhost',user='root',password='123456', db='pydb', charset='utf8')
    cursor=conn.cursor()
    sql="insert into book(title,pub,pages,author) values(%s,%s,%s,%s)"
    cursor.execute(sql,data)
    conn.commit()
    conn.close()
    
data=('안드로이드','한빛',650,'홍길동')
insert_book(data)

def insert_book_list(datas):
    conn=pymysql.connect(host='localhost',user='root',password='123456',db='pydb',charset='utf8')
    cursor=conn.cursor()
    sql="insert into book(title,pub,pages,author) values(%s,%s,%s,%s)"
    cursor.executemany(sql,datas)
    conn.commit()
    conn.close()
datas=[('안드로이드','한빛',650,'홍길동'),
 ('Oracle DB','한빛',650,'홍길동'),
 ('Spring','영딘',650,'홍길동')]
insert_book_list(datas)

In [23]:
def select_all():
  conn=pymysql.connect(host='localhost',
    user='root',
    password='123456', 
    db='pydb', 
    charset='utf8')
  cursor=conn.cursor()
  sql="select * from book"
  cursor.execute(sql)
  for book in cursor:
   print(book)
  conn.close()
select_all()

(1, '안드로이드', '한빛', 650, '홍길동')
(2, '안드로이드', '한빛', 650, '홍길동')
(3, '안드로이드', '한빛', 650, '홍길동')
(4, 'Oracle DB', '한빛', 650, '홍길동')
(5, 'Spring', '영딘', 650, '홍길동')
(6, '안드로이드', '한빛', 650, '홍길동')
(7, '안드로이드', '한빛', 650, '홍길동')
(8, 'Oracle DB', '한빛', 650, '홍길동')
(9, 'Spring', '영딘', 650, '홍길동')
(10, '안드로이드', '한빛', 650, '홍길동')
(11, '안드로이드', '한빛', 650, '홍길동')
(12, 'Oracle DB', '한빛', 650, '홍길동')
(13, 'Spring', '영딘', 650, '홍길동')
(14, '안드로이드', '한빛', 650, '홍길동')
(15, '안드로이드', '한빛', 650, '홍길동')
(16, 'Oracle DB', '한빛', 650, '홍길동')
(17, 'Spring', '영딘', 650, '홍길동')

In [24]:
def update_book(data):
  conn=pymysql.connect(host='localhost',user='root',password='123456',db='pydb',charset='utf8')
  cursor=conn.cursor()
  sql="update book set title=%s, pub=%s, pages=%s, author=%s where id=%s"
  cursor.execute(sql,data)
  conn.commit()
  conn.close()
data=('Java', '생능','700','홍길동',1)
update_book(data)
select_all()

(1, 'Java', '생능', 700, '홍길동')
(2, '안드로이드', '한빛', 650, '홍길동')
(3, '안드로이드', '한빛', 650, '홍길동')
(4, 'Oracle DB', '한빛', 650, '홍길동')
(5, 'Spring', '영딘', 650, '홍길동')
(6, '안드로이드', '한빛', 650, '홍길동')
(7, '안드로이드', '한빛', 650, '홍길동')
(8, 'Oracle DB', '한빛', 650, '홍길동')
(9, 'Spring', '영딘', 650, '홍길동')
(10, '안드로이드', '한빛', 650, '홍길동')
(11, '안드로이드', '한빛', 650, '홍길동')
(12, 'Oracle DB', '한빛', 650, '홍길동')
(13, 'Spring', '영딘', 650, '홍길동')
(14, '안드로이드', '한빛', 650, '홍길동')
(15, '안드로이드', '한빛', 650, '홍길동')
(16, 'Oracle DB', '한빛', 650, '홍길동')
(17, 'Spring', '영딘', 650, '홍길동')

In [25]:
def update_book(datas):
  conn=pymysql.connect(host='localhost',user='root',password='123456',db='pydb',charset='utf8')
  cursor=conn.cursor()
  sql="update book set title=%s, pub=%s, pages=%s, author=%s where id=%s"
  cursor.executemany(sql,datas)
  conn.commit()
  conn.close()
datas=[('Java2', '생능','700','최주호',2),
  ('Java3', '한빛','700','홍길동',3),
  ('Java4', '길벗','700','박경미',4)]
update_book(datas)
select_all()

(1, 'Java', '생능', 700, '홍길동')
(2, 'Java2', '생능', 700, '최주호')
(3, 'Java3', '한빛', 700, '홍길동')
(4, 'Java4', '길벗', 700, '박경미')
(5, 'Spring', '영딘', 650, '홍길동')
(6, '안드로이드', '한빛', 650, '홍길동')
(7, '안드로이드', '한빛', 650, '홍길동')
(8, 'Oracle DB', '한빛', 650, '홍길동')
(9, 'Spring', '영딘', 650, '홍길동')
(10, '안드로이드', '한빛', 650, '홍길동')
(11, '안드로이드', '한빛', 650, '홍길동')
(12, 'Oracle DB', '한빛', 650, '홍길동')
(13, 'Spring', '영딘', 650, '홍길동')
(14, '안드로이드', '한빛', 650, '홍길동')
(15, '안드로이드', '한빛', 650, '홍길동')
(16, 'Oracle DB', '한빛', 650, '홍길동')
(17, 'Spring', '영딘', 650, '홍길동')

In [26]:
def delete_book(data):
  conn=pymysql.connect(host='localhost',user='root',password='123456', 
  db='pydb', charset='utf8')
  cursor=conn.cursor()
  sql="delete from book where id=%s"
  #cursor.execute(sql,data)
  cursor.executemany(sql,data)
  conn.commit()
  conn.close()
#delete_book(4)
delete_book([1,2])
select_all()

(3, 'Java3', '한빛', 700, '홍길동')
(4, 'Java4', '길벗', 700, '박경미')
(5, 'Spring', '영딘', 650, '홍길동')
(6, '안드로이드', '한빛', 650, '홍길동')
(7, '안드로이드', '한빛', 650, '홍길동')
(8, 'Oracle DB', '한빛', 650, '홍길동')
(9, 'Spring', '영딘', 650, '홍길동')
(10, '안드로이드', '한빛', 650, '홍길동')
(11, '안드로이드', '한빛', 650, '홍길동')
(12, 'Oracle DB', '한빛', 650, '홍길동')
(13, 'Spring', '영딘', 650, '홍길동')
(14, '안드로이드', '한빛', 650, '홍길동')
(15, '안드로이드', '한빛', 650, '홍길동')
(16, 'Oracle DB', '한빛', 650, '홍길동')
(17, 'Spring', '영딘', 650, '홍길동')